#Дан файл f, компоненти якого є цілими числами. Записати в файл g всі подвоєні
#компоненти файлу f.
#Курдупов Олексій Леонідович 122Г
g=open('4.1.text2.txt', 'w')#Створюємо файли
f=open('4.1.text1.txt', 'r')
for i in f:
    count=int(i)*2
    count2=str(count)
    g.write( count2) #Запишемо їх у файл g.

g=open('4.1.text2.txt', 'r')#Відкриємо файл g
fd=g.read()
print('Елементи файлу g: ', fd) #Виведемо на екран.
